# Optional LAB | Subsetting and Descriptive Stats

## Before your start:
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import numpy as np
import pandas as pd
import statistics as stats
import math # floor

# Challenge 1
#### In this challenge we will use the `temp_states`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
# your code here
temp = pd.read_csv('data/Temp_States.csv')

#### Print `temp`.

In [3]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

In [4]:
temp.shape

(7, 3)

In [5]:
temp['State'].unique()

array(['New York', 'Connecticut', 'New Jersey'], dtype=object)

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [6]:
# check data types
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [7]:
# group columns by data type
temp.columns.to_series().groupby(temp.dtypes).groups

{float64: ['Temperature'], object: ['City', 'State']}

In [8]:
# check the info
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   City         7 non-null      object
 1   State        7 non-null      object
 2   Temperature  7 non-null      float64
dtypes: float64(1), object(2)
memory usage: 296.0+ bytes

In [9]:
# check the nulls
temp.isna().any()

City           False
State          False
Temperature    False
dtype: bool

- It's a very short database with only 7 rows
- There is only one column with numeric type
- There are no nulls

#### Select the rows where state is New York.

In [10]:
NYC = temp[temp.State.str.contains('New York',case=False)]
NYC

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [11]:
NYC_avg = NYC["Temperature"].mean()

In [12]:
print("The average temperature of cities in New York:", NYC_avg)

The average temperature of cities in New York: 10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [13]:
# way A of do it using .query
temp_above=temp.query('Temperature>=15')
temp_above.reset_index(drop=True, inplace=True)
temp_above

       City        State  Temperature
0       NYC     New York    19.444444
1  Hartford  Connecticut    17.222222
2    Treton   New Jersey    22.222222
3    Newark   New Jersey    20.000000

In [14]:
# way B of do it using .loc
temp_above.loc[temp['Temperature'] >= 15]

     City       State  Temperature
0     NYC    New York    19.444444
3  Newark  New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [15]:
# way A of doing it - .using .query and drop state column
temp_above_city=temp.query('Temperature>=15')
temp_above_city=temp_above_city.drop(['State'], axis = 1)
temp_above_city.reset_index(drop=True, inplace=True)
temp_above_city

       City  Temperature
0       NYC    19.444444
1  Hartford    17.222222
2    Treton    22.222222
3    Newark    20.000000

In [16]:
# way B of do it using .loc and selecting the city column 
temp_above_city = temp.loc[temp["Temperature"] >= 15, "City"]
temp_above_city

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [17]:
# way A of doing it - .using .query and drop state column
temp_between = temp[temp['Temperature'].between(15, 20)]
temp_between = temp_between.drop(['State'], axis = 1)
temp_between.reset_index(drop=True, inplace=True)
temp_between

       City  Temperature
0       NYC    19.444444
1  Hartford    17.222222
2    Newark    20.000000

In [18]:
# way B of do it - using .loc and storing only the city and temp column 
temp_betw = temp.loc[(temp['Temperature'] >= 15) & (temp['Temperature'] <= 20)]
temp_betw = temp_betw[['City','Temperature']]
temp_betw

       City  Temperature
0       NYC    19.444444
3  Hartford    17.222222
6    Newark    20.000000

#### Find the mean and standard deviation of the temperature of each state.

In [19]:
# the mean temperature by states
temp.groupby('State')['Temperature'].mean()

State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741
Name: Temperature, dtype: float64

In [20]:
# the standard deviation temperature by states
temp.groupby('State')['Temperature'].std()

State
Connecticut    1.964186
New Jersey     1.571348
New York       8.133404
Name: Temperature, dtype: float64

# Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [21]:
# your code here
employees = pd.read_csv('data/employee.csv')

#### Explore the data types of the `employees` dataframe. Comment your results.

In [22]:
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

In [23]:
employees.shape

(9, 7)

In [24]:
employees['Department'].unique()

array(['IT', 'HR', 'Sales'], dtype=object)

In [25]:
employees['Education'].unique()

array(['Bachelor', 'Master', 'Phd'], dtype=object)

In [26]:
employees['Title'].unique()

array(['analyst', 'associate', 'VP'], dtype=object)

In [27]:
# check data types
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

#### What's the average salary in this company?

In [28]:
empl_sal_mean = employees['Salary'].mean()
print("The average salary in this company is:", round(empl_sal_mean))

The average salary in this company is: 49

#### What's the highest salary?

In [29]:
empl_sal_max = employees['Salary'].max()
print("The highest salary is:", round(empl_sal_max))

The highest salary is: 70

#### What's the lowest salary?

In [30]:
empl_sal_min = employees['Salary'].min()
print("The lowest salary is:", round(empl_sal_min))

The lowest salary is: 30

#### Who are the employees with the lowest salary?

In [31]:
employees.loc[employees['Salary']==employees['Salary'].min(),:]

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [32]:
print(employees.loc[[2]])

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

In [33]:
david = employees[employees['Name'].str.contains("David")]
david

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [34]:
david['Salary']

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [35]:
associate = employees[employees['Title'].str.contains("associate")]
associate

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [36]:
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [37]:
employees.iloc[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [38]:
employees.loc[(employees['Title'] == 'associate') & (employees['Salary'] >= 55)]

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [39]:
years_salary = employees.groupby('Years')['Salary'].mean()
round(years_salary)

Years
1    35.0
2    38.0
3    55.0
4    35.0
7    60.0
8    70.0
Name: Salary, dtype: float64

####  What is the average salary per title?

In [40]:
title_salary = employees.groupby('Title')['Salary'].mean()
round(title_salary)

Title
VP           70.0
analyst      32.0
associate    57.0
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [41]:
iqr=np.percentile(employees['Salary'],75)-np.percentile(employees['Salary'],25)
iqr

25.0

In [42]:
upper_limit = np.percentile(employees['Salary'],75)+ 1.5*iqr
upper_limit

97.5

In [43]:
lower_limit= np.percentile(employees['Salary'],25)- 1.5*iqr
lower_limit

-2.5

#### Is the mean salary different per gender?

In [44]:
employees.groupby('Gender')['Salary'].mean()

Gender
F    47.5
M    50.0
Name: Salary, dtype: float64

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [45]:
# numeric columns
employees.select_dtypes(np.number)

   Years  Salary
0      1      35
1      2      30
2      2      30
3      4      35
4      3      55
5      2      55
6      8      70
7      7      60
8      8      70

In [46]:
# long way - not authomatical
y_mean = employees.groupby('Department').mean()['Years']
y_min = employees.groupby('Department').min()['Years']
y_max = employees.groupby('Department').max()['Years']
s_mean = employees.groupby('Department').mean()['Salary']
s_min = employees.groupby('Department').min()['Salary']
s_max = employees.groupby('Department').max()['Salary']

In [47]:
# short way - using groupby function with aggregation to get mean, min and max values
dep_mmm = employees.groupby('Department').agg({'Years':['mean', 'min', 'max'],'Salary':['mean', 'min', 'max']})
round(dep_mmm)

           Years         Salary
            mean min max   mean min max
Department
HR           5.0   2   8   45.0  30  70
IT           4.0   1   8   49.0  30  70
Sales        2.0   2   3   55.0  55  55

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [48]:
result = employees.groupby('Department')['Salary'].agg(['max','min'])
result['diff'] = result['max']-result['min']
result['diff']

Department
HR       40
IT       40
Sales     0
Name: diff, dtype: int64

In [49]:
print('The difference between the max and the min is:', result[['diff']])

The difference between the max and the min is:             diff
Department
HR            40
IT            40
Sales          0

# Challenge 3
#### Open the `orders` dataset. Name your dataset `orders`.

In [50]:
# your code here
orders = pd.read_csv('data/orders.csv')

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [51]:
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

- Unnamed:0 column is innecessary because is the same as the index
- InvoiceDate should be a date
- InvoiceNo and CustomerID should be a string (because we are not gonna operate over it)

In [52]:
orders.shape

(397924, 14)

In [53]:
# check data types
orders.dtypes

Unnamed: 0        int64
InvoiceNo         int64
StockCode        object
year              int64
month             int64
day               int64
hour              int64
Description      object
Quantity          int64
InvoiceDate      object
UnitPrice       float64
CustomerID        int64
Country          object
amount_spent    float64
dtype: object

In [54]:
# group columns by data type
orders.columns.to_series().groupby(orders.dtypes).groups

{int64: ['Unnamed: 0', 'InvoiceNo', 'year', 'month', 'day', 'hour', 'Quantity', 'CustomerID'], float64: ['UnitPrice', 'amount_spent'], object: ['StockCode', 'Description', 'InvoiceDate', 'Country']}

In [55]:
# check the info
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397924 entries, 0 to 397923
Data columns (total 14 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Unnamed: 0    397924 non-null  int64
 1   InvoiceNo     397924 non-null  int64
 2   StockCode     397924 non-null  object
 3   year          397924 non-null  int64
 4   month         397924 non-null  int64
 5   day           397924 non-null  int64
 6   hour          397924 non-null  int64
 7   Description   397924 non-null  object
 8   Quantity      397924 non-null  int64
 9   InvoiceDate   397924 non-null  object
 10  UnitPrice     397924 non-null  float64
 11  CustomerID    397924 non-null  int64
 12  Country       397924 non-null  object
 13  amount_spent  397924 non-null  float64
dtypes: float64(2), int64(8), object(4)
memory usage: 42.5+ MB

In [56]:
# check the nulls
orders.isna().any()

Unnamed: 0      False
InvoiceNo       False
StockCode       False
year            False
month           False
day             False
hour            False
Description     False
Quantity        False
InvoiceDate     False
UnitPrice       False
CustomerID      False
Country         False
amount_spent    False
dtype: bool

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [57]:
orders.dtypes

Unnamed: 0        int64
InvoiceNo         int64
StockCode        object
year              int64
month             int64
day               int64
hour              int64
Description      object
Quantity          int64
InvoiceDate      object
UnitPrice       float64
CustomerID        int64
Country          object
amount_spent    float64
dtype: object

In [58]:
orders.head(2)

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

In [59]:
# drop unnamed: 0 because is the same as the index 
orders = orders.drop(['Unnamed: 0'], axis=1)

In [60]:
# change InvoiceNo from int to string 
# change CustomerID from int to string
orders.astype({"InvoiceNo": str, "CustomerID": str})

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
397920,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
397921,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397922,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397923,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

In [61]:
# change InvoiceDate from obj to datetime
orders['InvoiceDate']= pd.to_datetime(orders['InvoiceDate'])

In [62]:
# check the orders type
orders.dtypes

InvoiceNo                int64
StockCode               object
year                     int64
month                    int64
day                      int64
hour                     int64
Description             object
Quantity                 int64
InvoiceDate     datetime64[ns]
UnitPrice              float64
CustomerID               int64
Country                 object
amount_spent           float64
dtype: object

In [63]:
# check if everything is okey (e.g. the invoice date is still a date and has not disolved into nans hehe )
orders.head(2)

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

In [64]:
"""
your comments here
"""

'\nyour comments here\n'

####  What is the average purchase price?

In [84]:
avg_purchase = orders['amount_spent'].mean()
print('The average purchase price is:', round(avg_purchase))

The average purchase price is: 22

#### What are the highest and lowest purchase prices?

In [85]:
# aggregation to get min and max values
highest_lowest = orders.agg({'amount_spent':['min', 'max']})
round(highest_lowest)

     amount_spent
min           0.0
max      168470.0

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [67]:
CustomerID
Country Spain

#### How many customers do we have in Spain?

In [68]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [69]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [70]:
# your code here

#### Select all free orders.

In [71]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [72]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [73]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [74]:
# your code here

#### Select all orders made in the month of August.

In [75]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [76]:
# your code here

#### What's the  average amount of money spent by country?

In [77]:
# your code here

#### What's the most expensive item?

In [78]:
# your code here

#### What is the average amount spent per year?

In [79]:
# your code here